
export const menus = [
  'undo',  // 撤销
  'redo',  // 重复
  "|",
  'head',  // 标题
  'bold',  // 粗体
  'fontSize',  // 字号
  'fontName',  // 字体
  'italic',  // 斜体
  'underline',  // 下划线
  'strikeThrough',  // 删除线
  'foreColor',  // 文字颜色
  'backColor',  // 背景颜色
  'link',  // 插入链接
  'list',  // 列表
  'justify',  // 对齐方式
  'quote',  // 引用
  // 'emoticon',  // 表情
  'image',  // 插入图片
  'table',  // 表格
  // 'video',  // 插入视频
  'code',  // 插入代码
]

export const lang = {
  '设置标题': tr('设置标题'),
  '正文': tr('正文'),
  '字号': tr('字号'),
  '字体': tr('字体'),
  '文字颜色': tr('文字颜色'),
  '背景色': tr('背景色'),
  '图片链接': tr('图片链接'),
  '链接文字': tr('链接文字'),
  '链接': tr('链接'),
  '插入表格': tr('插入表格'),
  '插入视频': tr('插入视频'),
  '插入代码': tr('插入代码'),
  '插入': tr('插入'),
  '设置列表': tr('设置列表'),
  '有序列表': tr('有序列表'),
  '无序列表': tr('无序列表'),
  '对齐方式': tr('对齐方式'),
  '靠左': tr('靠左'),
  '居中': tr('居中'),
  '靠右': tr('靠右'),
  '上传图片': tr('上传图片'),
  '网络图片': tr('网络图片'),
  '创建': tr('创建'),
  '行': tr('行'),
  '列的表格': tr('列的表格'),
  '格式如': tr('格式如')
}
